MCUdude/MightyCore/avr/boards.txt
1284.menu.LTO.Os_flto=LTO enabled
1284.menu.LTO.Os_flto.compiler.c.extra_flags=-Wextra -flto -g
1284.menu.LTO.Os_flto.compiler.c.elf.extra_flags=-w -flto -g
1284.menu.LTO.Os_flto.compiler.cpp.extra_flags=-Wextra -flto -g
1284.menu.LTO.Os_flto.ltoarcmd=avr-gcc-ar

# Clock frequencies
1284.menu.clock.16MHz_external=External 16 MHz
1284.menu.clock.16MHz_external.upload.speed=115200
1284.menu.clock.16MHz_external.bootloader.low_fuses=0xf7
1284.menu.clock.16MHz_external.build.clkpr=
1284.menu.clock.16MHz_external.build.clock_speed={build.f_cpu}
1284.menu.clock.16MHz_external.build.f_cpu=16000000L

1284.menu.clock.20MHz_external=External 20 MHz
1284.menu.clock.20MHz_external.upload.speed=115200
1284.menu.clock.20MHz_external.bootloader.low_fuses=0xf7
1284.menu.clock.20MHz_external.build.clkpr=
1284.menu.clock.20MHz_external.build.clock_speed={build.f_cpu}
1284.menu.clock.20MHz_external.build.f_cpu=20000000L

1284.menu.clock.18_432MHz_external=External 18.4320 MHz
1284.menu.clock.18_432MHz_external.upload.speed=115200
1284.menu.clock.18_432MHz_external.bootloader.low_fuses=0xf7
1284.menu.clock.18_432MHz_external.build.clkpr=
1284.menu.clock.18_432MHz_external.build.clock_speed={build.f_cpu}
1284.menu.clock.18_432MHz_external.build.f_cpu=18432000L

1284.menu.clock.14_7456MHz_external=External 14.7456 MHz
1284.menu.clock.14_7456MHz_external.upload.speed=115200
1284.menu.clock.14_7456MHz_external.bootloader.low_fuses=0xf7
1284.menu.clock.14_7456MHz_external.build.clkpr=
1284.menu.clock.14_7456MHz_external.build.clock_speed={build.f_cpu}
1284.menu.clock.14_7456MHz_external.build.f_cpu=14745600L

1284.menu.clock.12MHz_external=External 12 MHz
1284.menu.clock.12MHz_external.upload.speed=57600
1284.menu.clock.12MHz_external.bootloader.low_fuses=0xf7
1284.menu.clock.12MHz_external.build.clkpr=
1284.menu.clock.12MHz_external.build.clock_speed={build.f_cpu}
1284.menu.clock.12MHz_external.build.f_cpu=12000000L

1284.menu.clock.11_0592MHz_external=External 11.0592 MHz
1284.menu.clock.11_0592MHz_external.upload.speed=115200
1284.menu.clock.11_0592MHz_external.bootloader.low_fuses=0xf7
1284.menu.clock.11_0592MHz_external.build.clkpr=
1284.menu.clock.11_0592MHz_external.build.clock_speed={build.f_cpu}
1284.menu.clock.11_0592MHz_external.build.f_cpu=11059200L

1284.menu.clock.8MHz_external=External 8 MHz
1284.menu.clock.8MHz_external.upload.speed=57600
1284.menu.clock.8MHz_external.bootloader.low_fuses=0xf7
1284.menu.clock.8MHz_external.build.clkpr=
1284.menu.clock.8MHz_external.build.clock_speed={build.f_cpu}
1284.menu.clock.8MHz_external.build.f_cpu=8000000L

1284.menu.clock.7_3728MHz_external=External 7.3728 MHz
1284.menu.clock.7_3728MHz_external.upload.speed=115200
1284.menu.clock.7_3728MHz_external.bootloader.low_fuses=0xf7
1284.menu.clock.7_3728MHz_external.build.clkpr=
1284.menu.clock.7_3728MHz_external.build.clock_speed={build.f_cpu}
1284.menu.clock.7_3728MHz_external.build.f_cpu=7372800L

1284.menu.clock.4MHz_external=External 4 MHz
1284.menu.clock.4MHz_external.upload.speed=9600
1284.menu.clock.4MHz_external.bootloader.low_fuses=0xf7
1284.menu.clock.4MHz_external.build.clkpr=
1284.menu.clock.4MHz_external.build.clock_speed={build.f_cpu}
1284.menu.clock.4MHz_external.build.f_cpu=4000000L

1284.menu.clock.3_6864MHz_external=External 3.6864 MHz
1284.menu.clock.3_6864MHz_external.upload.speed=115200
1284.menu.clock.3_6864MHz_external.bootloader.low_fuses=0xf7
1284.menu.clock.3_6864MHz_external.build.clkpr=
1284.menu.clock.3_6864MHz_external.build.clock_speed={build.f_cpu}
1284.menu.clock.3_6864MHz_external.build.f_cpu=3686400L

1284.menu.clock.2MHz_external=External 2 MHz
1284.menu.clock.2MHz_external.upload.speed=9600
1284.menu.clock.2MHz_external.bootloader.low_fuses=0xf7
1284.menu.clock.2MHz_external.build.clkpr=
1284.menu.clock.2MHz_external.build.clock_speed={build.f_cpu}
1284.menu.clock.2MHz_external.build.f_cpu=2000000L

1284.menu.clock.1_8432MHz_external=External 1.8432 MHz
1284.menu.clock.1_8432MHz_external.upload.speed=115200
1284.menu.clock.1_8432MHz_external.bootloader.low_fuses=0xf7
1284.menu.clock.1_8432MHz_external.build.clkpr=
1284.menu.clock.1_8432MHz_external.build.clock_speed={build.f_cpu}
1284.menu.clock.1_8432MHz_external.build.f_cpu=1843200L

1284.menu.clock.1MHz_external=External 1 MHz
1284.menu.clock.1MHz_external.upload.speed=9600
1284.menu.clock.1MHz_external.bootloader.low_fuses=0xf7
1284.menu.clock.1MHz_external.build.clkpr=
1284.menu.clock.1MHz_external.build.clock_speed={build.f_cpu}
1284.menu.clock.1MHz_external.build.f_cpu=1000000L

1284.menu.clock.8MHz_internal=Internal 8 MHz
1284.menu.clock.8MHz_internal.upload.speed=38400
1284.menu.clock.8MHz_internal.bootloader.low_fuses=0xe2
1284.menu.clock.8MHz_internal.build.clkpr=
1284.menu.clock.8MHz_internal.build.clock_speed={build.f_cpu}
1284.menu.clock.8MHz_internal.build.f_cpu=8000000L

1284.menu.clock.4MHz_internal=Internal 4 MHz
1284.menu.clock.4MHz_internal.upload.speed=9600
1284.menu.clock.4MHz_internal.bootloader.low_fuses=0xe2
1284.menu.clock.4MHz_internal.build.clkpr=-DOSC_PRESCALER=0x01
1284.menu.clock.4MHz_internal.build.clock_speed=8000000L
1284.menu.clock.4MHz_internal.build.f_cpu=4000000L

1284.menu.clock.2MHz_internal=Internal 2 MHz
1284.menu.clock.2MHz_internal.upload.speed=9600
1284.menu.clock.2MHz_internal.bootloader.low_fuses=0xe2
1284.menu.clock.2MHz_internal.build.clkpr=-DOSC_PRESCALER=0x02
1284.menu.clock.2MHz_internal.build.clock_speed=8000000L
1284.menu.clock.2MHz_internal.build.f_cpu=2000000L

1284.menu.clock.1MHz_internal=Internal 1 MHz
1284.menu.clock.1MHz_internal.upload.speed=9600
1284.menu.clock.1MHz_internal.bootloader.low_fuses=0x62
1284.menu.clock.1MHz_internal.build.clkpr=
1284.menu.clock.1MHz_internal.build.clock_speed={build.f_cpu}
1284.menu.clock.1MHz_internal.build.f_cpu=1000000L


# C++ Language Standard
1284.menu.CppLanguageStandard.Default=Default

1284.menu.CppLanguageStandard.Cpp11=C++11
1284.menu.CppLanguageStandard.Cpp11.compiler.cpp.languageStandard=-std=gnu++11

1284.menu.CppLanguageStandard.Cpp14=C++14
1284.menu.CppLanguageStandard.Cpp14.compiler.cpp.languageStandard=-std=gnu++14

