MCUdude/MightyCore/avr/boards.txt
324.menu.LTO.Os_flto=LTO enabled
324.menu.LTO.Os_flto.compiler.c.extra_flags=-Wextra -flto -g
324.menu.LTO.Os_flto.compiler.c.elf.extra_flags=-w -flto -g
324.menu.LTO.Os_flto.compiler.cpp.extra_flags=-Wextra -flto -g
324.menu.LTO.Os_flto.ltoarcmd=avr-gcc-ar

# Clock frequencies
324.menu.clock.16MHz_external=External 16 MHz
324.menu.clock.16MHz_external.upload.speed=115200
324.menu.clock.16MHz_external.bootloader.low_fuses=0b1111{bootloader.cksel_bits}
324.menu.clock.16MHz_external.build.clkpr=
324.menu.clock.16MHz_external.build.clock_speed={build.f_cpu}
324.menu.clock.16MHz_external.build.f_cpu=16000000L

324.menu.clock.20MHz_external=External 20 MHz
324.menu.clock.20MHz_external.upload.speed=115200
324.menu.clock.20MHz_external.bootloader.low_fuses=0b1111{bootloader.cksel_bits}
324.menu.clock.20MHz_external.build.clkpr=
324.menu.clock.20MHz_external.build.clock_speed={build.f_cpu}
324.menu.clock.20MHz_external.build.f_cpu=20000000L

324.menu.clock.18_432MHz_external=External 18.4320 MHz
324.menu.clock.18_432MHz_external.upload.speed=115200
324.menu.clock.18_432MHz_external.bootloader.low_fuses=0b1111{bootloader.cksel_bits}
324.menu.clock.18_432MHz_external.build.clkpr=
324.menu.clock.18_432MHz_external.build.clock_speed={build.f_cpu}
324.menu.clock.18_432MHz_external.build.f_cpu=18432000L

324.menu.clock.14_7456MHz_external=External 14.7456 MHz
324.menu.clock.14_7456MHz_external.upload.speed=115200
324.menu.clock.14_7456MHz_external.bootloader.low_fuses=low_fuses=0b1111{bootloader.cksel_bits}
324.menu.clock.14_7456MHz_external.build.clkpr=
324.menu.clock.14_7456MHz_external.build.clock_speed={build.f_cpu}
324.menu.clock.14_7456MHz_external.build.f_cpu=14745600L

324.menu.clock.12MHz_external=External 12 MHz
324.menu.clock.12MHz_external.upload.speed=57600
324.menu.clock.12MHz_external.bootloader.low_fuses=0b1111{bootloader.cksel_bits}
324.menu.clock.12MHz_external.build.clkpr=
324.menu.clock.12MHz_external.build.clock_speed={build.f_cpu}
324.menu.clock.12MHz_external.build.f_cpu=12000000L

324.menu.clock.11_0592MHz_external=External 11.0592 MHz
324.menu.clock.11_0592MHz_external.upload.speed=115200
324.menu.clock.11_0592MHz_external.bootloader.low_fuses=0b1111{bootloader.cksel_bits}
324.menu.clock.11_0592MHz_external.build.clkpr=
324.menu.clock.11_0592MHz_external.build.clock_speed={build.f_cpu}
324.menu.clock.11_0592MHz_external.build.f_cpu=11059200L

324.menu.clock.8MHz_external=External 8 MHz
324.menu.clock.8MHz_external.upload.speed=57600
324.menu.clock.8MHz_external.bootloader.low_fuses=0b1111{bootloader.cksel_bits}
324.menu.clock.8MHz_external.build.clkpr=
324.menu.clock.8MHz_external.build.clock_speed={build.f_cpu}
324.menu.clock.8MHz_external.build.f_cpu=8000000L

324.menu.clock.7_3728MHz_external=External 7.3728 MHz
324.menu.clock.7_3728MHz_external.upload.speed=115200
324.menu.clock.7_3728MHz_external.bootloader.low_fuses=0b1111{bootloader.cksel_bits}
324.menu.clock.7_3728MHz_external.build.clkpr=
324.menu.clock.7_3728MHz_external.build.clock_speed={build.f_cpu}
324.menu.clock.7_3728MHz_external.build.f_cpu=7372800L

324.menu.clock.4MHz_external=External 4 MHz
324.menu.clock.4MHz_external.upload.speed=9600
324.menu.clock.4MHz_external.bootloader.low_fuses=0b1111{bootloader.cksel_bits}
324.menu.clock.4MHz_external.build.clkpr=
324.menu.clock.4MHz_external.build.clock_speed={build.f_cpu}
324.menu.clock.4MHz_external.build.f_cpu=4000000L

324.menu.clock.3_6864MHz_external=External 3.6864 MHz
324.menu.clock.3_6864MHz_external.upload.speed=115200
324.menu.clock.3_6864MHz_external.bootloader.low_fuses=0b1111{bootloader.cksel_bits}
324.menu.clock.3_6864MHz_external.build.clkpr=
324.menu.clock.3_6864MHz_external.build.clock_speed={build.f_cpu}
324.menu.clock.3_6864MHz_external.build.f_cpu=3686400L

324.menu.clock.2MHz_external=External 2 MHz
324.menu.clock.2MHz_external.upload.speed=9600
324.menu.clock.2MHz_external.bootloader.low_fuses=0b1111{bootloader.cksel_bits}
324.menu.clock.2MHz_external.build.clkpr=
324.menu.clock.2MHz_external.build.clock_speed={build.f_cpu}
324.menu.clock.2MHz_external.build.f_cpu=2000000L

324.menu.clock.1_8432MHz_external=External 1.8432 MHz
324.menu.clock.1_8432MHz_external.upload.speed=115200
324.menu.clock.1_8432MHz_external.bootloader.low_fuses=0b1111{bootloader.cksel_bits}
324.menu.clock.1_8432MHz_external.build.clkpr=
324.menu.clock.1_8432MHz_external.build.clock_speed={build.f_cpu}
324.menu.clock.1_8432MHz_external.build.f_cpu=1843200L

324.menu.clock.1MHz_external=External 1 MHz
324.menu.clock.1MHz_external.upload.speed=9600
324.menu.clock.1MHz_external.bootloader.low_fuses=0b1111{bootloader.cksel_bits}
324.menu.clock.1MHz_external.build.clkpr=
324.menu.clock.1MHz_external.build.clock_speed={build.f_cpu}
324.menu.clock.1MHz_external.build.f_cpu=1000000L

324.menu.clock.8MHz_internal=Internal 8 MHz
324.menu.clock.8MHz_internal.upload.speed=38400
324.menu.clock.8MHz_internal.bootloader.low_fuses=0xe2
324.menu.clock.8MHz_internal.build.clkpr=
324.menu.clock.8MHz_internal.build.clock_speed={build.f_cpu}
324.menu.clock.8MHz_internal.build.f_cpu=8000000L

324.menu.clock.4MHz_internal=Internal 4 MHz
324.menu.clock.4MHz_internal.upload.speed=9600
324.menu.clock.4MHz_internal.bootloader.low_fuses=0xe2
324.menu.clock.4MHz_internal.build.clkpr=-DOSC_PRESCALER=0x01
324.menu.clock.4MHz_internal.build.clock_speed=8000000L
324.menu.clock.4MHz_internal.build.f_cpu=4000000L

324.menu.clock.2MHz_internal=Internal 2 MHz
324.menu.clock.2MHz_internal.upload.speed=9600
324.menu.clock.2MHz_internal.bootloader.low_fuses=0xe2
324.menu.clock.2MHz_internal.build.clkpr=-DOSC_PRESCALER=0x02
324.menu.clock.2MHz_internal.build.clock_speed=8000000L
324.menu.clock.2MHz_internal.build.f_cpu=2000000L

324.menu.clock.1MHz_internal=Internal 1 MHz
324.menu.clock.1MHz_internal.upload.speed=9600
324.menu.clock.1MHz_internal.bootloader.low_fuses=0x62
324.menu.clock.1MHz_internal.build.clkpr=
324.menu.clock.1MHz_internal.build.clock_speed={build.f_cpu}
324.menu.clock.1MHz_internal.build.f_cpu=1000000L

# C++ Language Standard
324.menu.CppLanguageStandard.Default=Default
324.menu.CppLanguageStandard.Default.compiler.cpp.extra_flags=

324.menu.CppLanguageStandard.Cpp11=C++11
324.menu.CppLanguageStandard.Cpp11.compiler.cpp.extra_flags=-std=gnu++11

324.menu.CppLanguageStandard.Cpp14=C++14
324.menu.CppLanguageStandard.Cpp14.compiler.cpp.extra_flags=-std=gnu++14

