MCUdude/MightyCore/avr/boards.txt
324.menu.CppLanguageStandard.Cpp17=C++17
324.menu.CppLanguageStandard.Cpp17.compiler.cpp.extra_flags=-std=gnu++17



##########################
#### ATmega164A/P/PA  ####
##########################

# General
164.name=ATmega164
164.upload.tool=avrdude
164.upload.maximum_data_size=1024
164.bootloader.tool=avrdude
164.bootloader.unlock_bits=0x3f
164.bootloader.lock_bits=0x0f
164.build.core=MCUdude_corefiles
164.build.board=AVR_ATmega164
164.build.extra_flags={build.clkpr}

# Upload port select
164.menu.bootloader.uart0=Yes (UART0)
164.menu.bootloader.uart0.upload.maximum_size=32256
164.menu.bootloader.uart0.upload.protocol=arduino
164.menu.bootloader.uart0.upload.port=UART0
164.menu.bootloader.uart0.build.export_merged_output=true
164.menu.bootloader.uart0.bootloader.high_fuses=0b1101{bootloader.eesave_bit}100
164.menu.bootloader.uart0.bootloader.file=optiboot_flash/bootloaders/{build.mcu}/{build.clock_speed}/optiboot_flash_{build.mcu}_{upload.port}_{upload.speed}_{build.clock_speed}_{build.bootloader_led}.hex

164.menu.bootloader.uart1=Yes (UART1)
164.menu.bootloader.uart1.upload.maximum_size=32256
164.menu.bootloader.uart1.upload.protocol=arduino
164.menu.bootloader.uart1.upload.port=UART1
164.menu.bootloader.uart1.build.export_merged_output=true
164.menu.bootloader.uart1.bootloader.high_fuses=0b1101{bootloader.eesave_bit}100
164.menu.bootloader.uart1.bootloader.file=optiboot_flash/bootloaders/{build.mcu}/{build.clock_speed}/optiboot_flash_{build.mcu}_{upload.port}_{upload.speed}_{build.clock_speed}_{build.bootloader_led}.hex

164.menu.bootloader.no_bootloader=No bootloader
164.menu.bootloader.no_bootloader.upload.maximum_size=32768
164.menu.bootloader.no_bootloader.build.export_merged_output=false
164.menu.bootloader.no_bootloader.bootloader.high_fuses=0b1101{bootloader.eesave_bit}101
164.menu.bootloader.no_bootloader.bootloader.file=empty/empty.hex

# EEPROM
164.menu.eeprom.keep=EEPROM retained
164.menu.eeprom.keep.bootloader.eesave_bit=0
164.menu.eeprom.erase=EEPROM not retained
164.menu.eeprom.erase.bootloader.eesave_bit=1

# Pinouts
164.menu.pinout.standard=Standard pinout
164.menu.pinout.standard.build.variant=standard
164.menu.pinout.standard.build.bootloader_led=B0
164.menu.pinout.bobuino=Bobuino pinout
164.menu.pinout.bobuino.build.variant=bobuino
164.menu.pinout.bobuino.build.bootloader_led=B7
164.menu.pinout.sanguino=Sanguino pinout
164.menu.pinout.sanguino.build.variant=sanguino
164.menu.pinout.sanguino.build.bootloader_led=B0

# Variants
164.menu.variant.modelP=164P / 164PA
164.menu.variant.modelP.build.mcu=atmega164p
164.menu.variant.modelA=164A
164.menu.variant.modelA.build.mcu=atmega164a

# Brown out detection
164.menu.BOD.2v7=BOD 2.7V
164.menu.BOD.2v7.bootloader.extended_fuses=0xfd
164.menu.BOD.4v3=BOD 4.3V
164.menu.BOD.4v3.bootloader.extended_fuses=0xfc
164.menu.BOD.1v8=BOD 1.8V
164.menu.BOD.1v8.bootloader.extended_fuses=0xfe
164.menu.BOD.disabled=BOD disabled
164.menu.BOD.disabled.bootloader.extended_fuses=0xff

# Compiler link time optimization
164.menu.LTO.Os=LTO disabled
164.menu.LTO.Os.compiler.c.extra_flags=
164.menu.LTO.Os.compiler.c.elf.extra_flags=
164.menu.LTO.Os.compiler.cpp.extra_flags=
164.menu.LTO.Os.ltoarcmd=avr-ar

164.menu.LTO.Os_flto=LTO enabled
164.menu.LTO.Os_flto.compiler.c.extra_flags=-Wextra -flto -g
164.menu.LTO.Os_flto.compiler.c.elf.extra_flags=-w -flto -g
164.menu.LTO.Os_flto.compiler.cpp.extra_flags=-Wextra -flto -g
164.menu.LTO.Os_flto.ltoarcmd=avr-gcc-ar

# Clock frequencies
164.menu.clock.16MHz_external=External 16 MHz
164.menu.clock.16MHz_external.upload.speed=115200
164.menu.clock.16MHz_external.bootloader.low_fuses=0xf7
164.menu.clock.16MHz_external.build.clkpr=
164.menu.clock.16MHz_external.build.clock_speed={build.f_cpu}
164.menu.clock.16MHz_external.build.f_cpu=16000000L

164.menu.clock.20MHz_external=External 20 MHz
164.menu.clock.20MHz_external.upload.speed=115200
164.menu.clock.20MHz_external.bootloader.low_fuses=0xf7
164.menu.clock.20MHz_external.build.clkpr=
164.menu.clock.20MHz_external.build.clock_speed={build.f_cpu}
164.menu.clock.20MHz_external.build.f_cpu=20000000L

164.menu.clock.18_432MHz_external=External 18.4320 MHz
164.menu.clock.18_432MHz_external.upload.speed=115200
164.menu.clock.18_432MHz_external.bootloader.low_fuses=0xf7
164.menu.clock.18_432MHz_external.build.clkpr=
164.menu.clock.18_432MHz_external.build.clock_speed={build.f_cpu}
164.menu.clock.18_432MHz_external.build.f_cpu=18432000L

164.menu.clock.14_7456MHz_external=External 14.7456 MHz
164.menu.clock.14_7456MHz_external.upload.speed=115200
164.menu.clock.14_7456MHz_external.bootloader.low_fuses=0xf7
164.menu.clock.14_7456MHz_external.build.clkpr=
164.menu.clock.14_7456MHz_external.build.clock_speed={build.f_cpu}
164.menu.clock.14_7456MHz_external.build.f_cpu=14745600L

164.menu.clock.12MHz_external=External 12 MHz
164.menu.clock.12MHz_external.upload.speed=57600
164.menu.clock.12MHz_external.bootloader.low_fuses=0xf7
164.menu.clock.12MHz_external.build.clkpr=
164.menu.clock.12MHz_external.build.clock_speed={build.f_cpu}
164.menu.clock.12MHz_external.build.f_cpu=12000000L

164.menu.clock.11_0592MHz_external=External 11.0592 MHz
164.menu.clock.11_0592MHz_external.upload.speed=115200
164.menu.clock.11_0592MHz_external.bootloader.low_fuses=0xf7
164.menu.clock.11_0592MHz_external.build.clkpr=
164.menu.clock.11_0592MHz_external.build.clock_speed={build.f_cpu}
164.menu.clock.11_0592MHz_external.build.f_cpu=11059200L

164.menu.clock.8MHz_external=External 8 MHz
164.menu.clock.8MHz_external.upload.speed=57600
164.menu.clock.8MHz_external.bootloader.low_fuses=0xf7
164.menu.clock.8MHz_external.build.clkpr=
164.menu.clock.8MHz_external.build.clock_speed={build.f_cpu}
164.menu.clock.8MHz_external.build.f_cpu=8000000L

164.menu.clock.7_3728MHz_external=External 7.3728 MHz
164.menu.clock.7_3728MHz_external.upload.speed=115200
164.menu.clock.7_3728MHz_external.bootloader.low_fuses=0xf7
164.menu.clock.7_3728MHz_external.build.clkpr=
164.menu.clock.7_3728MHz_external.build.clock_speed={build.f_cpu}
164.menu.clock.7_3728MHz_external.build.f_cpu=7372800L

