MCUdude/MightyCore/avr/boards.txt
164.menu.clock.4MHz_external=External 4 MHz
164.menu.clock.4MHz_external.upload.speed=9600
164.menu.clock.4MHz_external.bootloader.low_fuses=0xf7
164.menu.clock.4MHz_external.build.clkpr=
164.menu.clock.4MHz_external.build.clock_speed={build.f_cpu}
164.menu.clock.4MHz_external.build.f_cpu=4000000L

164.menu.clock.3_6864MHz_external=External 3.6864 MHz
164.menu.clock.3_6864MHz_external.upload.speed=115200
164.menu.clock.3_6864MHz_external.bootloader.low_fuses=0xf7
164.menu.clock.3_6864MHz_external.build.clkpr=
164.menu.clock.3_6864MHz_external.build.clock_speed={build.f_cpu}
164.menu.clock.3_6864MHz_external.build.f_cpu=3686400L

164.menu.clock.2MHz_external=External 2 MHz
164.menu.clock.2MHz_external.upload.speed=9600
164.menu.clock.2MHz_external.bootloader.low_fuses=0xf7
164.menu.clock.2MHz_external.build.clkpr=
164.menu.clock.2MHz_external.build.clock_speed={build.f_cpu}
164.menu.clock.2MHz_external.build.f_cpu=2000000L

164.menu.clock.1_8432MHz_external=External 1.8432 MHz
164.menu.clock.1_8432MHz_external.upload.speed=115200
164.menu.clock.1_8432MHz_external.bootloader.low_fuses=0xf7
164.menu.clock.1_8432MHz_external.build.clkpr=
164.menu.clock.1_8432MHz_external.build.clock_speed={build.f_cpu}
164.menu.clock.1_8432MHz_external.build.f_cpu=1843200L

164.menu.clock.1MHz_external=External 1 MHz
164.menu.clock.1MHz_external.upload.speed=9600
164.menu.clock.1MHz_external.bootloader.low_fuses=0xf7
164.menu.clock.1MHz_external.build.clkpr=
164.menu.clock.1MHz_external.build.clock_speed={build.f_cpu}
164.menu.clock.1MHz_external.build.f_cpu=1000000L

164.menu.clock.8MHz_internal=Internal 8 MHz
164.menu.clock.8MHz_internal.upload.speed=38400
164.menu.clock.8MHz_internal.bootloader.low_fuses=0xe2
164.menu.clock.8MHz_internal.build.clkpr=
164.menu.clock.8MHz_internal.build.clock_speed={build.f_cpu}
164.menu.clock.8MHz_internal.build.f_cpu=8000000L

164.menu.clock.4MHz_internal=Internal 4 MHz
164.menu.clock.4MHz_internal.upload.speed=9600
164.menu.clock.4MHz_internal.bootloader.low_fuses=0xe2
164.menu.clock.4MHz_internal.build.clkpr=-DOSC_PRESCALER=0x01
164.menu.clock.4MHz_internal.build.clock_speed=8000000L
164.menu.clock.4MHz_internal.build.f_cpu=4000000L

164.menu.clock.2MHz_internal=Internal 2 MHz
164.menu.clock.2MHz_internal.upload.speed=9600
164.menu.clock.2MHz_internal.bootloader.low_fuses=0xe2
164.menu.clock.2MHz_internal.build.clkpr=-DOSC_PRESCALER=0x02
164.menu.clock.2MHz_internal.build.clock_speed=8000000L
164.menu.clock.2MHz_internal.build.f_cpu=2000000L

164.menu.clock.1MHz_internal=Internal 1 MHz
164.menu.clock.1MHz_internal.upload.speed=9600
164.menu.clock.1MHz_internal.bootloader.low_fuses=0x62
164.menu.clock.1MHz_internal.build.clkpr=
164.menu.clock.1MHz_internal.build.clock_speed={build.f_cpu}
164.menu.clock.1MHz_internal.build.f_cpu=1000000L

# C++ Language Standard
164.menu.CppLanguageStandard.Default=Default
164.menu.CppLanguageStandard.Default.compiler.cpp.extra_flags=

164.menu.CppLanguageStandard.Cpp11=C++11
164.menu.CppLanguageStandard.Cpp11.compiler.cpp.extra_flags=-std=gnu++11

164.menu.CppLanguageStandard.Cpp14=C++14
164.menu.CppLanguageStandard.Cpp14.compiler.cpp.extra_flags=-std=gnu++14

164.menu.CppLanguageStandard.Cpp17=C++17
164.menu.CppLanguageStandard.Cpp17.compiler.cpp.extra_flags=-std=gnu++17



#####################
#### ATmega32/A  ####
#####################

# General
32.name=ATmega32
32.upload.tool=avrdude
32.upload.maximum_data_size=2048
32.bootloader.tool=avrdude
32.bootloader.unlock_bits=0x3f
32.bootloader.lock_bits=0x0f
32.bootloader.low_fuses=0b{bootloader.bod_bits}{bootloader.sut_cksel_bits}
32.bootloader.high_fuses=0b110{bootloader.ckopt_bit}{bootloader.eesave_bit}11{bootloader.bootrst_bit}
32.build.core=MCUdude_corefiles
32.build.board=AVR_ATmega32
32.build.mcu=atmega32

# Upload port select
32.menu.bootloader.uart0=Yes (UART0)
32.menu.bootloader.uart0.upload.maximum_size=32256
32.menu.bootloader.uart0.upload.protocol=arduino
32.menu.bootloader.uart0.upload.port=UART0
32.menu.bootloader.uart0.build.export_merged_output=true
32.menu.bootloader.uart0.bootloader.bootrst_bit=0
32.menu.bootloader.uart0.bootloader.file=optiboot_flash/bootloaders/{build.mcu}/{build.f_cpu}/optiboot_flash_{build.mcu}_{upload.port}_{upload.speed}_{build.f_cpu}_{build.bootloader_led}.hex

32.menu.bootloader.no_bootloader=No bootloader
32.menu.bootloader.no_bootloader.upload.maximum_size=32768
32.menu.bootloader.no_bootloader.build.export_merged_output=false
32.menu.bootloader.no_bootloader.bootloader.bootrst_bit=1
32.menu.bootloader.no_bootloader.bootloader.file=empty/empty.hex

# EEPROM
32.menu.eeprom.keep=EEPROM retained
32.menu.eeprom.keep.bootloader.eesave_bit=0
32.menu.eeprom.erase=EEPROM not retained
32.menu.eeprom.erase.bootloader.eesave_bit=1

# Pinouts
32.menu.pinout.standard=Standard pinout
32.menu.pinout.standard.build.variant=standard
32.menu.pinout.standard.build.bootloader_led=B0
32.menu.pinout.bobuino=Bobuino pinout
32.menu.pinout.bobuino.build.variant=bobuino
32.menu.pinout.bobuino.build.bootloader_led=B7
32.menu.pinout.sanguino=Sanguino pinout
32.menu.pinout.sanguino.build.variant=sanguino
32.menu.pinout.sanguino.build.bootloader_led=B0

# Brown out detection - This is the first part of the low fuse bit concatenation
32.menu.BOD.2v7=BOD 2.7V
32.menu.BOD.2v7.bootloader.bod_bits=10
32.menu.BOD.4v0=BOD 4.0V
32.menu.BOD.4v0.bootloader.bod_bits=00
32.menu.BOD.disabled=BOD disabled
32.menu.BOD.disabled.bootloader.bod_bits=11

# Compiler link time optimization
32.menu.LTO.Os=LTO disabled
32.menu.LTO.Os.compiler.c.extra_flags=
32.menu.LTO.Os.compiler.c.elf.extra_flags=
32.menu.LTO.Os.compiler.cpp.extra_flags=
32.menu.LTO.Os.ltoarcmd=avr-ar

32.menu.LTO.Os_flto=LTO enabled
32.menu.LTO.Os_flto.compiler.c.extra_flags=-Wextra -flto -g
32.menu.LTO.Os_flto.compiler.c.elf.extra_flags=-w -flto -g
32.menu.LTO.Os_flto.compiler.cpp.extra_flags=-Wextra -flto -g
32.menu.LTO.Os_flto.ltoarcmd=avr-gcc-ar

# Clock frequencies - This is the second part of the low fuse bit concatenation
32.menu.clock.16MHz_external=External 16 MHz
32.menu.clock.16MHz_external.upload.speed=115200
32.menu.clock.16MHz_external.bootloader.sut_cksel_bits=111111
32.menu.clock.16MHz_external.bootloader.ckopt_bit=0
32.menu.clock.16MHz_external.build.f_cpu=16000000L

32.menu.clock.20MHz_external=External 20 MHz
32.menu.clock.20MHz_external.upload.speed=115200
32.menu.clock.20MHz_external.bootloader.sut_cksel_bits=111111
32.menu.clock.20MHz_external.bootloader.ckopt_bit=0
32.menu.clock.20MHz_external.build.f_cpu=20000000L

