MCUdude/MightyCore/avr/boards.txt
32.menu.clock.18_432MHz_external=External 18.4320 MHz
32.menu.clock.18_432MHz_external.upload.speed=115200
32.menu.clock.18_432MHz_external.bootloader.sut_cksel_bits=111111
32.menu.clock.18_432MHz_external.bootloader.ckopt_bit=0
32.menu.clock.18_432MHz_external.build.f_cpu=18432000L

32.menu.clock.14_7456MHz_external=External 14.7456 MHz
32.menu.clock.14_7456MHz_external.upload.speed=115200
32.menu.clock.14_7456MHz_external.bootloader.sut_cksel_bits=111111
32.menu.clock.14_7456MHz_external.bootloader.ckopt_bit=0
32.menu.clock.14_7456MHz_external.build.f_cpu=14745600L

32.menu.clock.12MHz_external=External 12 MHz
32.menu.clock.12MHz_external.upload.speed=57600
32.menu.clock.12MHz_external.bootloader.sut_cksel_bits=111111
32.menu.clock.12MHz_external.bootloader.ckopt_bit=0
32.menu.clock.12MHz_external.build.f_cpu=12000000L

32.menu.clock.11_0592MHz_external=External 11.0592 MHz
32.menu.clock.11_0592MHz_external.upload.speed=115200
32.menu.clock.11_0592MHz_external.bootloader.sut_cksel_bits=111111
32.menu.clock.11_0592MHz_external.bootloader.ckopt_bit=0
32.menu.clock.11_0592MHz_external.build.f_cpu=11059200L

32.menu.clock.8MHz_external=External 8 MHz
32.menu.clock.8MHz_external.upload.speed=57600
32.menu.clock.8MHz_external.bootloader.sut_cksel_bits=111111
32.menu.clock.8MHz_external.bootloader.ckopt_bit=0
32.menu.clock.8MHz_external.build.f_cpu=8000000L

32.menu.clock.7_3728MHz_external=External 7.3728 MHz
32.menu.clock.7_3728MHz_external.upload.speed=115200
32.menu.clock.7_3728MHz_external.bootloader.sut_cksel_bits=111111
32.menu.clock.7_3728MHz_external.bootloader.ckopt_bit=0
32.menu.clock.7_3728MHz_external.build.f_cpu=7372800L

32.menu.clock.4MHz_external=External 4 MHz
32.menu.clock.4MHz_external.upload.speed=9600
32.menu.clock.4MHz_external.bootloader.sut_cksel_bits=111111
32.menu.clock.4MHz_external.bootloader.ckopt_bit=0
32.menu.clock.4MHz_external.build.f_cpu=4000000L

32.menu.clock.3_6864MHz_external=External 3.6864 MHz
32.menu.clock.3_6864MHz_external.upload.speed=115200
32.menu.clock.3_6864MHz_external.bootloader.sut_cksel_bits=111111
32.menu.clock.3_6864MHz_external.bootloader.ckopt_bit=0
32.menu.clock.3_6864MHz_external.build.f_cpu=3686400L

32.menu.clock.2MHz_external=External 2 MHz
32.menu.clock.2MHz_external.upload.speed=9600
32.menu.clock.2MHz_external.bootloader.sut_cksel_bits=111111
32.menu.clock.2MHz_external.bootloader.ckopt_bit=0
32.menu.clock.2MHz_external.build.f_cpu=2000000L

32.menu.clock.1_8432MHz_external=External 1.8432 MHz
32.menu.clock.1_8432MHz_external.upload.speed=115200
32.menu.clock.1_8432MHz_external.bootloader.sut_cksel_bits=111111
32.menu.clock.1_8432MHz_external.bootloader.ckopt_bit=0
32.menu.clock.1_8432MHz_external.build.f_cpu=1843200L

32.menu.clock.1MHz_external=External 1 MHz
32.menu.clock.1MHz_external.upload.speed=9600
32.menu.clock.1MHz_external.bootloader.sut_cksel_bits=111111
32.menu.clock.1MHz_external.bootloader.ckopt_bit=0
32.menu.clock.1MHz_external.build.f_cpu=1000000L

32.menu.clock.8MHz_internal=Internal 8 MHz
32.menu.clock.8MHz_internal.upload.speed=38400
32.menu.clock.8MHz_internal.bootloader.sut_cksel_bits=100100
32.menu.clock.8MHz_internal.bootloader.ckopt_bit=1
32.menu.clock.8MHz_internal.build.f_cpu=8000000L

32.menu.clock.4MHz_internal=Internal 4 MHz
32.menu.clock.4MHz_internal.upload.speed=9600
32.menu.clock.4MHz_internal.bootloader.sut_cksel_bits=100001
32.menu.clock.4MHz_internal.bootloader.ckopt_bit=1
32.menu.clock.4MHz_internal.build.f_cpu=4000000L

32.menu.clock.2MHz_internal=Internal 2 MHz
32.menu.clock.2MHz_internal.upload.speed=9600
32.menu.clock.2MHz_internal.bootloader.sut_cksel_bits=100001
32.menu.clock.2MHz_internal.bootloader.ckopt_bit=1
32.menu.clock.2MHz_internal.build.f_cpu=2000000L

32.menu.clock.1MHz_internal=Internal 1 MHz
32.menu.clock.1MHz_internal.upload.speed=9600
32.menu.clock.1MHz_internal.bootloader.sut_cksel_bits=100001
32.menu.clock.1MHz_internal.bootloader.ckopt_bit=1
32.menu.clock.1MHz_internal.build.f_cpu=1000000L

# C++ Language Standard
32.menu.CppLanguageStandard.Default=Default
32.menu.CppLanguageStandard.Default.compiler.cpp.extra_flags=

32.menu.CppLanguageStandard.Cpp11=C++11
32.menu.CppLanguageStandard.Cpp11.compiler.cpp.extra_flags=-std=gnu++11

32.menu.CppLanguageStandard.Cpp14=C++14
32.menu.CppLanguageStandard.Cpp14.compiler.cpp.extra_flags=-std=gnu++14

32.menu.CppLanguageStandard.Cpp17=C++17
32.menu.CppLanguageStandard.Cpp17.compiler.cpp.extra_flags=-std=gnu++17



#####################
#### ATmega16/A  ####
#####################

# General
16.name=ATmega16
16.upload.tool=avrdude
16.upload.maximum_data_size=1024
16.bootloader.tool=avrdude
16.bootloader.unlock_bits=0x3f
16.bootloader.lock_bits=0x0f
16.bootloader.low_fuses=0b{bootloader.bod_bits}{bootloader.sut_cksel_bits}
16.bootloader.high_fuses=0b110{bootloader.ckopt_bit}{bootloader.eesave_bit}10{bootloader.bootrst_bit}
16.build.core=MCUdude_corefiles
16.build.board=AVR_ATmega16
16.build.mcu=atmega16

# Upload port select
16.menu.bootloader.uart0=Yes (UART0)
16.menu.bootloader.uart0.upload.maximum_size=15872
16.menu.bootloader.uart0.upload.protocol=arduino
16.menu.bootloader.uart0.upload.port=UART0
16.menu.bootloader.uart0.build.export_merged_output=true
16.menu.bootloader.uart0.bootloader.bootrst_bit=0
16.menu.bootloader.uart0.bootloader.file=optiboot_flash/bootloaders/{build.mcu}/{build.f_cpu}/optiboot_flash_{build.mcu}_{upload.port}_{upload.speed}_{build.f_cpu}_{build.bootloader_led}.hex

16.menu.bootloader.no_bootloader=No bootloader
16.menu.bootloader.no_bootloader.upload.maximum_size=16384
16.menu.bootloader.no_bootloader.build.export_merged_output=false
16.menu.bootloader.no_bootloader.bootloader.bootrst_bit=1
16.menu.bootloader.no_bootloader.bootloader.file=empty/empty.hex

# EEPROM
16.menu.eeprom.keep=EEPROM retained
16.menu.eeprom.keep.bootloader.eesave_bit=0
16.menu.eeprom.erase=EEPROM not retained
16.menu.eeprom.erase.bootloader.eesave_bit=1

# Pinouts
16.menu.pinout.standard=Standard pinout
16.menu.pinout.standard.build.variant=standard
16.menu.pinout.standard.build.bootloader_led=B0
16.menu.pinout.bobuino=Bobuino pinout
16.menu.pinout.bobuino.build.variant=bobuino
16.menu.pinout.bobuino.build.bootloader_led=B7
16.menu.pinout.sanguino=Sanguino pinout
16.menu.pinout.sanguino.build.variant=sanguino
16.menu.pinout.sanguino.build.bootloader_led=B0

